---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.GetSizeInFloats
source: html/9e13ae0f-ea74-b708-4617-9a62f1cbced0.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.GetSizeInFloats Method

Gets the amount of storage that the vertex takes up in a buffer, measured in floats.

## Syntax (C#)
```csharp
public static int GetSizeInFloats()
```

## Returns
The number of floats occupied by one vertex of this type.